app/Controllers/BrandController.php

SELECT *
FROM `brands`
---
    public function index()
    {
        $brandModel = new BrandModel();
        // Get the brand code from the session
        $data['brand'] = $brandModel->findAll();