app/Controllers/GaransiSparepartController.php

    public function index()
    {
        $garansisparepartModel = new SparepartwarrantyModel();
        // Get the garansi_sparepart value from the session
        $data['garansi_sparepart'] = $garansisparepartModel->findAll();
---
SELECT *
FROM `sparepart_warranties`