app/Controllers/GaransiKompresorController.php

    public function index()
    {
        $garansikompresorModel = new CompressorwarrantyModel();
        // Get the garansi_kompresor value from the session
        $data['garansi_kompresor'] = $garansikompresorModel->findAll();
---
SELECT *
FROM `compressor_warranties`