app/Controllers/KapasitasController.php

    public function index()
    {
        $kapasitasModel = new CapacityModel();
        // Get the kapasitas value from the session
        $data['kapasitas'] = $kapasitasModel->findAll();
---
SELECT *
FROM `capacities`