app/Controllers/KategoriController.php

SELECT *
FROM `categories`
---
    public function index()
    {
        $kategoriModel = new CategoryModel();
        // Get the kategori code from the session
        $data['kategori'] = $kategoriModel->findAll();