app/Controllers/SubkategoriController.php

    public function deleteSubkategori($id)
    {
        $subcategoryModel = new SubcategoryModel();

        if (!$subcategoryModel->find($id)) {
            return redirect()->to('/subkategori')->with('error', 'Subcategory not found.');
        }

        $subcategoryModel->delete($id);
---
SELECT *
FROM `subcategories`
WHERE `subcategories`.`id` = '7'
DELETE FROM `subcategories`
WHERE `id` IN ('7')