app/Models/CategoryModel.php

    public function getCategories()
    {
        return $this->findAll(); // Retrieve all categories
---
SELECT *
FROM `categories`