app/Models/SubcategoryModel.php

    public function getSubcategoriesWithCategory()
    {
        return $this->select('subcategories.id, subcategories.name as subcategory_name, categories.name as category_name')
                    ->join('categories', 'categories.id = subcategories.category_id') // Join with categories table
                    ->findAll();
---
SELECT `subcategories`.`id`, `subcategories`.`name` as `subcategory_name`, `categories`.`name` as `category_name`
FROM `subcategories`
JOIN `categories` ON `categories`.`id` = `subcategories`.`category_id`